{"rating": "1", "date": ["19 April 2018"], "user_name": "sundog-jr", "user_id": "ur30689888", "title": "Honest to god, is this what \"comedy\" has come to?", "content": "I saw a free screening and somehow still wanted my money back. This kind of self-indulgent crap is why people don't trust Hollywood comedies anymore. Not only is the cheesy message of this movie dishonest and singular to only one demographic of people, but it's a fairly obvious retread of Shallow Hal with a few key details changed. \nReplace Amy Schumer with literally anyone and it would be a little funnier, but not a whole lot, since the writing is so mediocre and predictable. \"Oh, it's what's on the INSIDE that counts! How did I not see it before?\" is the movie's realization, a message that had been beaten into the audience's head with a sledgehammer from minute one of the movie, but somehow it took this dense, unlikable, cringe-inducing protagonist an hour and a half of screen time to figure out. I laughed literally once during this film, when Schumer's character got her hair stuck in the stationary bike, which of course, is shown in the trailer. Was I laughing at the idea of Amy Schumer in pain, you ask? Possibly. Doesn't matter. Still counts as one laugh.\nJust skip it. Go see Super Troopers 2 instead and support people that actually have some talent and couldn't get their movie funded by a production company, (which leaves me to wonder how this utter abortion of a film did). ST2 isn't groundbreaking, but at least I didn't leave it wanting my money back."}
{"rating": "8", "date": ["20 April 2018"], "user_name": "valarik564", "user_id": "ur50375509", "title": "It doesn't try to be anything that it isn't. And that's kinda the point.", "content": "You're going to see a lot of reviews on here say that it's predictable, silly, probably a few other criticisms that are perfectly fair. But this movie knows what it is, and the authenticity makes it enjoyable. It has a genuinely sweet romance, great comedic moments, and good messages. It's a silly romcom with a lot of charm and heart, and it's worth a couple hours of your time. Give it a chance."}
{"rating": "8", "date": ["19 April 2018"], "user_name": "Adrienne", "user_id": "ur65630489", "title": "Scratching my head on all the hate", "content": "I see all of these 1 and 2 star ratings and utterly confused. This movie is not a 10 out of 10 by all means but definitely not a 1 or 2. Amy Schumer is very open about her figure as it is and is known to be comfortable in her own skin, which is why this movie is perfect for her. The movie is not a blockbuster hit or Emmy-worthy but still a great funny film to see with a group of friends or with your sister, cousin etc. I give the movie an 8 out of 10 because it delivered what it promised......Comedy."}
{"rating": "2", "date": ["19 April 2018"], "user_name": "trimblair", "user_id": "ur10067675", "title": "See the Jack Black version instead, SHALLOW HAL which is a MUCH better film", "content": "Amy just phones this one in with a lackluster script from a really terrible person. The humor here is like the standup stuff, offensive to anyone with any morals at all. Seriously, see SHALLOW HAL instead. It is funny with good special effects and a sense of direction. This film is another misfire from someone who should give up writing awful movies and stick to .... something else. SKIP THIS"}
{"rating": "7", "date": ["21 April 2018"], "user_name": "petsalv", "user_id": "ur87587589", "title": "This movie deserves a higher rating", "content": "I don't generally watch movies that rate under 6 stars just to save wasting time. I don't think I'll do that anymore.\nI went to see I Feel Pretty with a friend as the trailer had me hooked. \nI literally just created a IMDB account to leave a review because I just honestly can't believe how many awful reviews there are about this movie! Amy Schumer is every woman and I LOVED her in this. I laughed and nearly cried and above all felt empowered and walked out of the cinema feeling great about myself. Not many movies can do that.\nThe character development and screenwriting are both very sound, and although nothing we haven't seen before, this film is fun, loveable and simply one of the best 'feel good' movies I've seen in a long time.\nPlease don't let the ratings turn you off... It's hilarious. I can't wait to take my sister and mum and anyone else who will see it with me."}
{"rating": "8", "date": ["19 April 2018"], "user_name": "chandel_salwin", "user_id": "ur87537833", "title": "Enjoyable movie", "content": "I felt I had to write this review because I was really Impressed with this movie. I can honestly say I can not wait for this movie to go to DVD so I can watch it over and over. \nI'm not a Amy Schumacher fan if anything I avoid her movies.\nI was watching another movie when the trailer for this movie came on and it had me laughing.\nSo when the movie came out in the cinema I treated myself to a movie night on my own. I wasn't really expecting much maybe a few laughs and that's if I didn't see all the only funny bits in the trailer. \nI'm not going to give any of the movie away only that yes it was predictable and that's OK because I like many other women can see ourself in this movie. How many times have we thought if only I was Skinner, prettier, and so on. I feel pretty teaches us it really is what is on the inside that we project on the outside. Confidence is really what we all need more off. \nI liked this movie because I could see myself in so much some of the silly things she does, the whole movie was laughing even the men with their partners.\nGreat work Amy and cast, I do feel pretty."}
{"rating": "6", "date": ["22 April 2018"], "user_name": "Davor Blazevic", "user_id": "ur6136051", "title": "I Feel Pretty... feels sufficiently pretty and witty and bright", "content": "\"I Feel Pretty\" (2018) is not the greatest movie, but it's not a bad one either, at least not as bad as its current IMDb rating, 3.4 out of 10, shows. What's puzzling (well, only slightly, concerning the modern-days amount of preferred (?) exposure to the worlds of video games) is that movies having stories and subjects very little to do with reality: space operas, movies about superheroes... practically by default get the high rating, at least 7 out of 10, while not-at-all bad movies, but, in comparison to former, slightly unattractive since set unexcitingly in reality, get often an average, or, as in this case, a very low rating. So, which of the two is more important quality of the movies (today), having the story told well corresponding to reality, or their technical superiority?\nAnswers will offer opposing views, but numbers show that great majority of viewers appreciate later. I have also enjoyed spectacular show while watching the ginormous gorilla George (Saint George) killing the augmented alligator (slaying the dragon), in latest IMAX theatres' favourite \"Rampage\" (2018), but what's the point? There's no point, because point is supposed to make sense, and there's a little sense outside of reality. On contrary, as unimpressive as it is, \"I Feel Pretty\" is so real, and as such, more relevant in everyday life. \nAppealing factor in \"I Feel Pretty\" is the fact that movie managed to remain realistic in giving a believable reason (a head injury accident in a gym) for the main vehicle to move the story forward, i.e. for the changed perception of herself the leading character goes through, therefore gaining confidence and modifying the way she carries herself. Regular movie goer with longer viewing experience will easily recall how numerous other, pretty good movies from the past managed to be quite entertaining, but only after fantastic premise has been served. Time-traveling movies, among them the best known \"Back to the Future\" trilogy (1985, 1986, 1990) with Michael J. Fox and Christopher Lloyd, long list of body-swapping fantasies like \"Freaky Friday\" (1976) with Barbara Harris and Jodie Foster (remade in 2003 with Jamie Lee Curtis and Lindsay Lohan) as mother and daughter, whose personalities switch their bodies, Bill Murray's character repeatedly reliving the same day in \"Groundhog Day\" (1993), Michael Keaton's character quadrupled by cloning in \"Multiplicity\"... to name a few. So, once we accept the fantastic premise, those movies are even more entertaining than this one, but the great advantage of the movie \"I Feel Pretty\", at least great advantage for the likes of me, is that fantasy infusion has not been required.\nThanks to already experienced writers/first time directors, Abby Kohn and Marc Silverstein, for coming with a realistic reason (even if already seen before, as suggested elsewhere) for particular twist that propels the story, and then to Ms. Amy Schumer for successfully presenting it in achieving quite a fluent and humoristic narrative, and making it easy to accept her character, Renee Bennett, suddenly not limited only to her inner beauty, a fact surely aided by the circumstance that actress herself doesn't even fall in to the only other category... less beautiful... long ago advised as applicable for women.\n \nContrasting the dominant, loud female lead with her quiet, not shy (to deliver the line \"Can I be you when I grow up?\") but rather laid back, eventually boyfriend Ethan (Rory Scovel) was contributive, as well.\nFinally, in her supporting role as Avery LeClair, heiress to cosmetic line, although for her corporate position apparently sufficiently highly educated and quite well looking, Michelle Williams feels unsecure and requires help, so she uses suddenly wonderfully uninhibited Renee to deal with her physical (vocal) limitations, lack of business ideas, and other frustrations of her somewhat awkward position. Already established as dramatic actress, Williams uses this chance well to skillfully break into comedic acting by spicing her character with a touch of restrained lunacy. \nIn conclusion, film is at times touching, sufficiently amusing, and positively motivating... all of which should, hopefully, help (not only) girls \"feel pretty and witty and bright!\" (Line excerpted from the musical \"West Side Story\" and its song of the same title \"I Feel Pretty\".)"}
{"rating": "4", "date": ["19 April 2018"], "user_name": "st-shot", "user_id": "ur13178622", "title": "Schumer's career continues to spiral...downward.", "content": "Since her successful starring debut in Train Wreck back in 2015 Amy Schumer's career has taken a precipitous hit and it gets only worse in this predictable one note comedy meditation about the beauty within us with the abrasive Schumer more or less reprising the same slightly depressed semi sloven character to be found in her other leads. With an acting style that is no more than an iteration of the stage persona of droning sarcasm and whiny observation Schumer repeats it here with the nuanced same character to be found in 'Wreck and Snatched and it is beyond stale at this point. She does briefly move from her self pitying mope state when she bangs her head at a gym in the films linch pin scene that allows her to be obnoxiously confident for awhile as she struts about believing to be of incomparable beauty. But most of the meager humor is extracted by way of supporting characters and extra reactions to bombastic Renee's (Schumer) outrageous narcissistic turn which wears thin fast. \nWith whatever talent she had Amy Schumer has more than exhausted it after the abysmal Snatched, the stomach churning stand-up special (The Leather Show) that followed and now this banal chic flick that if it does not push the coarse comedian's movie star career over the cliff certainly has pushed it to the edge."}
{"rating": "2", "date": ["19 April 2018"], "user_name": "mdstueve-1", "user_id": "ur16832587", "title": "Cliche and lifeless", "content": "Guess she ran out of jokes to steal. This one falls flat with cringe worthy dialogue and is basically just a standard cheesy romcom. The occasional one liner will get you to chuckle but not very often."}
{"rating": "1", "date": ["19 April 2018"], "user_name": "asnyder71704", "user_id": "ur21457276", "title": "Enough", "content": "Just no please... Not funny and could even finish this.... maybe she had a career in pantomiming..."}
{"rating": "1", "date": ["19 April 2018"], "user_name": "judahmerrill", "user_id": "ur70417109", "title": "Trash", "content": "Headline says it all, Any attempt at a good message is buried in the lack of humor."}
{"rating": "8", "date": ["20 April 2018"], "user_name": "plasticanimalz", "user_id": "ur2613818", "title": "Great Fun!", "content": "There were at least two scenes where I literally bowled over laughing and produced tears. This being said, I find it hard to believe all the bad reviews (5 times more from men than woman) considering there's only been ONE screening so far and I don't think these are viewers from a pre-screening. Just a hunch. So, the majority of the reviews in are not from people who've actually seen the film. I realize there is this vast cadre of men who want to live in their fantasy that Jonah Hill and Michael Cera not only save the world but date super models or Emma Stone, and Amy Schumer messes with that fantasy lens. She's cool, get over it. Notice women don't flock to down-vote all the ridiculous kung fu and superhero movies men like, where mostly all they do is grunt. Perspective.\nOn to I Feel Pretty. I wasn't sure what to expect. Train wreck was very good and then the next one with Goldie Hawn was...okay, but just okay. I thought the Michelle William's Avery character was great. I probably wouldn't have realized it was her if I hadn't seen her name in the title. It was nice to see her doing comedy again, as she was great in that movie with Kirsten Dunst I can't say on IMDB without it getting flagged. You know, the one about Watergate. It was great to see Aidy and Sasheer from SNL. Andy has such great delivery and Sasheer is so visually expressive with her comedy. She can say a lot with just a look. I was afraid when Amy had her dialogue with Busy and Aidy it was going to get a bit too preachy about women but it didn't. It addressed it just enough then expressed the rest with the comedy. \nI'm not going to say specific moments I thought were hilarious or really got me 'cause I don't want to spoil anything, but the physical comedy was great and the Andrea Zuckerman moment was very funny for me. We were thoroughly entertained by this film. Amy Schumer really put some of her best work in this and it's a definite fun movie to see with your friends, sister, whomever."}
{"rating": "6", "date": ["19 April 2018"], "user_name": "Gavin Purtell", "user_id": "ur21319675", "title": "Slightly above-average romantic comedy", "content": "'I Feel Pretty' is a mostly-straightforward romantic comedy from the writers of 'Never Been Kissed', 'He's Just Not That Into You' and 'How To Be Single', so it's safe to assume you know pretty much what to expect. There's also a nice twist on the tried-and-tested body-switch plot - Renee (Schumer) hits her head and believes she has achieved her dream of becoming beautiful.\nRenee believing she's the hottest woman alive is where a lot of the humour comes from, but also some of the missteps - since Renee and her two friends, Jane (Phillips) and Vivian (Bryant), are not actually ugly. It's also where most of the sincere moments come from - it's not all about what you look like, but the confidence you have in yourself, highlighted in a rousing speech by Schumer near the end. She's (mostly) not too over-the-top and is (mostly) easy to cheer for.\nWhile not focusing solely on girl-meets-boy/falls-in-love/separate/get-back-together, it still manages to fit that all in, with Ethan (Scovel) a decent foil to Schumer. It's annoying that the backdrop to a film that's actually about not worrying about looks is centered around a make-up company, run by Avery (Williams) and Grant (Hopper) - both mostly pointless. Overall, it's not as good as 'Trainwreck', but nor is it a totally vapid \"chick flick\"."}
{"rating": "1", "date": ["19 April 2018"], "user_name": "rock_the_house-99685", "user_id": "ur78996941", "title": "Get off the screen.", "content": "Terrible plot. \nTerrible lead.\nSpoilers***\nDepressing"}
{"rating": null, "date": ["20 April 2018"], "user_name": "flhr22", "user_id": "ur37519524", "title": "More Schumer garbage", "content": "Undeveloped characters, recycled storylines and flat uninteresting jokes. Your basic Schumer project."}
{"rating": "8", "date": ["21 April 2018"], "user_name": "annacastillog", "user_id": "ur87588644", "title": "Not usually an Amy Schumer fan", "content": "I usually don't like her movies, I couldn't even finish Trainwreck. However, there's something endearing about the movie, and it did make me laugh, so it accomplished its job there. But, there's some scenes (not spoiling) that seemed unnecessary, almost as if the editor left them in by accident."}
{"rating": "1", "date": ["20 April 2018"], "user_name": "mark-4582", "user_id": "ur20176821", "title": "Stay home.", "content": "Don't waste your time and money to see this train wreck. In my opinion."}
{"rating": "7", "date": ["20 April 2018"], "user_name": "debra_botterill", "user_id": "ur19287618", "title": "Refreshing Romantic Comedy", "content": "I think most of the reviewers here must be Shumer haters. I enjoyed this movie. It's nice to see a comedic film nowadays that isn't littered with language, sex and slapstick violence. The entire audience last night laughed out loud a number of times. Plus the movie has a great message: be happy with who you are. While I don't think it's appropriate for very young children, teens and pretty much anyone else would enjoy this movie."}
{"rating": "10", "date": ["21 April 2018"], "user_name": "ckirby-64142", "user_id": "ur80871501", "title": "Stop it already!! It was a funny movie", "content": "This movie was great entertainment. The 2 and 3 Star people need to pick different movies! This is obviously not your genre. Amy Schumer did a great job and was super funny. Thanks for the laughs, girl. You rock!"}
{"rating": "6", "date": ["20 April 2018"], "user_name": "David Ferguson", "user_id": "ur0806494", "title": "a message from Amy", "content": "Greetings again from the darkness. Comedians taking the leap from TV to movies sometimes find the going a bit rough. Amy Schumer hit it big with critics and audiences in TRAINWRECK (2015), and then flopped with both groups in last year's SNATCHED (2017). This time out, she quells the raunchiness, and instead serves us a PG-13 message movie aimed squarely at adolescent girls. Ms. Schumer doesn't abandon comedy, it's now just a bit tamer and comes with a life lesson.\nRenee (Ms. Schumer) is a mostly normal person who works in a computer \"dungeon\" as website support for a high-end make-up company named Lily LeClaire. Adrian Martinez plays her usually unresponsive co-worker who seems quite comfortable with the lack of human interaction that comes with the daily process. When not at her dead-end job, Renee hangs out with her also mostly normal friends Vivian (Aidy Bryant) and Jane (Busy Phillips, wife of the film's co-director Marc Silverstein). Renee does seem to spend an inordinate amount of time hoping for her dream job (receptionist at Lily LeClaire headquarters) and her dream lifestyle (being beautiful and slim like the Lily LeClaire models). \nIf you've seen the trailer, you know what happens next. Renee gets conked on the head during a fitness class, and when she wakes up, she sees herself as the beautiful woman she always dreamed of becoming. Of course, her appearance hasn't changed the slightest, but the way she carries herself certainly has. Where once there was moping and hoping, there is now confidence and daring. Her self-esteem cup is overflowing and she falls into her dream job, and lands a terrific boyfriend, while also being pursued by a dreamy one.\nHer time at the company headquarters finds her interacting with CEO Avery LeClaire played with drop-dead perfect comedic timing from 4-time Oscar nominee Michelle Williams. Yes, THAT Michelle Williams! It's such a treat to see this talented actress step away from her usual dramatic characters and flat out nail a comedic role in which she seems to nearly flutter across the screen while sporting a voice that would typically only be heard in Saturday morning cartoons. The shared scenes with Ms. Schumer and Ms. Williams are the film's best, but unfortunately are too few - leaving some unexplored humor to our imaginations.\nCo-writers and co-directors Abby Kohn and Marc Silverstein (first time directors, co-writers of HE'S JUST NOT THAT INTO YOU) work hard to deliver the type of humor that Amy Schumer fans expect, while also paying respect to the all-important female body image message the film strives to deliver. It's a challenging proposal, however despite my finding much of the comedy predictable, the theatre was filled with laughter from what was very likely a group of loyal Schumer fans. The bikini contest sequence seemed especially effective in generating laughter and praise from the loyalists.\nAs for the boyfriend role of nice guy Ethan, Rory Scovel may seem like an odd choice. He's the anti-Hollywood leading man type - generally laid back with no glimmer of Type A personality. A quiet guy who takes Zumba classes is actually the perfect straight man for Schumer's dominating screen personality ... she does talk incessantly through most of the movie. Other supporting roles are filled by Lauren Hutton as Lilly \"Gram\" LeClaire, the company founder and grandmother to Avery; Emily Ratajkowski as Renee's fitness class acquaintance, whose sole purpose seems to be in convincing Renee that beautiful women have life struggles too; Naomi Campbell as a company executive; and Tom Hopper (\"Game of Thrones\"), as the required eye candy for a viewing audience likely to skew heavily female.\nMs. Schumer is surely to receive backlash on the movie due to utilizing a head injury to show her character the road to self-esteem and confidence. In my opinion she should be commended for using comedy and her celebrity to send this message to the girls out there. We never know what delivery method will work, and if a fake bump on the head in a movie gets a few girls to realize success in life is not about one's physical attractiveness, then I'm on board. Of course, there are many who say I'm not qualified to review the movie since, being a male, I can't possibly understand what girls go through. And on that point, they are likely correct."}
{"rating": "9", "date": ["20 April 2018"], "user_name": "jbursch-985-267052", "user_id": "ur25145978", "title": "Delivers really fun laughs and a message!", "content": "This movie delivers a simple clear message in a hilarious way ... love yourself. And you'll laugh while feeling the movie \"gets\" you, all of us. This is for your young self."}
{"rating": "7", "date": ["21 April 2018"], "user_name": "bickabah", "user_id": "ur30183761", "title": "Fun, funny, entertaining date night movie", "content": "I really enjoyed this movie. Classic Amy S physical comedy but not stupid like some comedies these days. Not raunchy either. Just good characters, good pace, and great message. It won't win Oscars of course but it's worth the price of the tickets. Go see it."}
{"rating": "8", "date": ["21 April 2018"], "user_name": "jamjdavi", "user_id": "ur87581269", "title": "Half these reviews haven't seen the movie", "content": "This is a good movie. Everyone on here is trashing it saying it's not funny or they didn't finish the movie. They missed the point. It's about self-image. I think it's incredibly empowering. It's not a slapstick comedy you'd expect from Schumer (which is good cause I'm not a huge fan of her other stuff). This is just a nice movie to make you feel better about who you are. Give it a chance, unlike these other reviewers who had a clear bias going in."}
{"rating": "8", "date": ["21 April 2018"], "user_name": "ksusie", "user_id": "ur72098184", "title": "Body positive!", "content": "I don't understand the negative reviews!! I suppose people think that it should be funnier because it's Amy Schumer, but humor is not the main point of the film. It is called I Feel Pretty for a reason. I loved that they didn't physically change her body when she thought she was 'beautiful', they changed her mindset. And I think that sends a strong message, and that is something that I need to do myself honestly. \nThe film was touching, funny, and motivating; I would definitely recommend this movie."}
{"rating": "10", "date": ["21 April 2018"], "user_name": "minecraftgirl-08188", "user_id": "ur86798256", "title": "GREAT COMEDIC MOVIE!!", "content": "I have no idea why people are commenting negatively on this movie!! I went to see this movie with my mom and my friend and we were dying the whole time! We read all of the terrible reviews about this movie and debated going to see it. 10/10 movie. Amy was the perfect part for this role. I would definitely see it again."}
{"rating": "4", "date": ["20 April 2018"], "user_name": "bbewnylorac", "user_id": "ur29589601", "title": "This movie is not a pretty sight", "content": "I love Amy Schumer. I think she's courageous, intelligent and very funny. That is why I am very disappointed in this stinker of a movie. I actually walked out halfway through. I thought, 'do I want to spend two hours of my precious life watching this human waste'? The answer was 'no', so I left. The movie's biggest problem is that it's supposed to be a comedy, but it's not funny. \nDid anyone at the film company watch the film before they released it? Did they laugh? No one in the cinema I was in, was laughing, except possibly at the comical fall off the exercise bike at the start of the movie - Schumer is good at physical comedy.\nI Feel Pretty actually has one or two things to say. We all know people who aren't necessarily beautiful but just breeze through life because they're super-confident. \nThat's what happens to Schumer's character when she mysteriously hits her head and transforms from a painfully insecure website designer to the receptionist at a cosmetics company who thinks she's hot. As shown in the scene where Amy's character picks up a guy in a dry cleaner, often a prospective partner just loves having someone else take charge and ask them on a date.\nMichelle Williams' character, the cosmetics executive, is supposed to represent the super-attractive woman who doesn't have a clue professionally or socially. But this character is too much of a flake to be interesting - she's so squeaky-voiced and delicate she doesn't have any substance. \nAnd what's with Schumer's supposedly ''ugly'' friends? It's so offensive to portray two of her supposed best friends as losers. It's a very common device in US films, when in fact most of the population aren't supermodel perfect in looks, i.e. most people are normal. \nThe movie doesn't seem to know what to do with these friends, although I guess it's the Schumer character who is the obnoxious one.\nI think people are being unkind when they say Schumer's career is going down the toilet. She does have genuine talent. But she can do far better than this."}
{"rating": "10", "date": ["21 April 2018"], "user_name": "camlee-71814", "user_id": "ur68217137", "title": "LOVE THIS MOVIE!", "content": "Great movie! I absolutely love anything Amy Schumer does! The movie is funny and heart warming! All of the negative reviews are just coming from people who get off on hating good comedy. Amy does nt deserve the hate. She is great!"}
{"rating": "10", "date": ["22 April 2018"], "user_name": "laurenstephens-38088", "user_id": "ur87616387", "title": "Why y'all so salty??", "content": "This movie was so funny I'm so confused with all the disappointed reviews like there was non stop giggles in the theater! I made an account because I almost didn't see this movie because the reviews were so awful but like wow it was the best movie I have seen in a long long time !! Don't be fooled by the haters it was great !"}
{"rating": "7", "date": ["21 April 2018"], "user_name": "trinaboice", "user_id": "ur52993466", "title": "Women will appreciate this a lot more than men", "content": "Grade: B+\nIn a Nutshell: \nEvery female is going to relate to this movie. I think it's fairly safe to say that every woman has insecurities about herself. \nWhether it's a lack of confidence about how we look or speak or do certain things, we all wish we felt better about ourselves. We can be our own worst enemy. The mirror certainly doesn't help. This isn't a movie about body shaming, but one of having self-confidence and trying to be your best self.\nIt's kind of a mix between Jack Black's comedy Shallow Hal and Tom Hank's charming movie Big (I loved both of them). It's a fun chick flick...meaning, take your besties to the theater, share a giant bucket of popcorn, and don't beat yourself up for not being so perfect.\n \nTips for parents: \n· Some profanity.\n· You see a lot of Amy Schumer's cleavage, mid-section, and bare naked back side a couple of times, complete with tramp stamp. There is also a scene with a bunch of beautiful women in skimpy bikinis.\n· There is a lot of talk about sex, as well as a super awkward sex scene where you see some skin. Pre-marital relations.\n· 2 gay men.\n· Renee (Amy Schumer) gets drunk.\n· One of the girls confesses she has HPV and explains it away by saying, \"Everyone has HPV.\" Um....nope. That's not true. Guess what? If you don't sleep around, you won't get it.\n Uplifting theme: \n· \"Believe in yourself.\" - Renee Bennett (Amy Schumer)\n· It's confidence that makes you beautiful and sexy.\n· \"Change your mind, change your life.\" - Soul Cycle teacher\n· \"We are real women. What a great thing to be.\" - Renee Bennett\n· Do YOU really see people? Do you judge people just by how they look?\n \n\nThings I liked:\n· Michelle Williams is hilarious and awesome. She's so effective in dramas, but it's also nice to see her in a comedic role. She has had an amazing few months in the success of The Greatest Showman , as well as All The Money In The World . She's on a roll!\n· Most young people won't know who Lauren Hutton is. There is a picture towards the very end of the movie that shows Lauren Hutton when she was at the peak of her modeling days as a young woman. I thought it was really fun to have her in the movie as Lily LeClaire.\n· Yep, it's true. Kentucky Fried Chicken does use Hidden Valley Ranch dressing.\n· I liked that the Soul Cycle teacher told all of the class participants to \"set an intention.\" If we were all more mindful and proactive about our lives, we'd be surprised at how much better things turned out. Renee (Amy Schumer) wears a sweatshirt at the beginning of the movie that says \"Get it Girl!\" which is the anthem of the movie. Take your flaws and STILL believe in yourself.\n· It's refreshing to see how brave Amy Schumer is about making fun of herself and flaunting her more than size 2 body. Her stand-up comedy bits have always been completely honest, although extremely raunchy. I admire that she doesn't let Hollywood make her feel terrible about herself.\n· I've been a big fan of Saturday Night Live ever since my college roommate and I would watch it together on a tiny TV in our dorm room. I love seeing a lot of the comediennes from SNL on movies lately. This one features the talented Aidy Bryant and Sasheer Zamata. \n· You'll see a lot of beautiful women like Naomi Campbell and Emily Ratajkowski.\n· I laughed at the beginning when the camera scanned all of Renee's beauty products in her bathroom. Most of us spend ridiculous amounts of money on products, hoping they will FINALLY be the magic pill to make us look prettier and feel better about ourselves. The ironic thing about this movie is that Renee works for a cosmetic company and her speech at the end sells more make-up.\n\n \nThings I didn't like:\n· You know what else is attractive? Virtue and humility. While Hollywood has been pumping out a lot of \"be who you are\" movies lately, there is a serious lack of movies that celebrate women, or men for that matter, who are virtuous and humble and chaste. Religious values are, more often than not, mocked in Hollywood movies. Yeah, that doesn't exactly get laughs or sell box office tickets, but I sure would like to see more well-behaved, good girls in movies being honored for a change.\n* Everyone loved Amy Schumer when she first hit the scene, but for some reason, it's now popular to hate her. Her stand-up routines are super trashy and she seems to celebrate being a skank, but I love that she doesn't apologize for not being the skinny model that Hollywood thinks she should be.\n· I thought it was funny that they grouped Busy Philipps with the \"average\" girlfriends, because I've always thought she was pretty.\n* I thought for sure that some time during the movie we'd hear a modern version of the famous West Side Story song, I Feel Pretty. Nope, it never played. Missed opportunity, right?\n* Women are definitely going to appreciate this movie more than men.\n\nFunny lines:\n· \"Can I be you when I grow up?\" - Ethan (Rory Scovel) \n\nInteresting lines:\n· \"I think a lot of people are confused about themselves.\" - Ethan\n· \"I started to believe that if I wanted it bad enough, all my dreams could come true.\" - Renee Bennett\n· \"What if we never lost that little girl confidence?\" - Renee\n· \"This make-up line won't change your life - only you can do that.\" - Renee\n· \"I know I look good. I don't need a room full of drunk guys to confirm it.\" - Renee\n· \"I am brave. I am blonde. And I got this!\" - Mason (Adrian Martinez)"}
{"rating": "10", "date": ["21 April 2018"], "user_name": "allysonjones-14100", "user_id": "ur79671117", "title": "Great movie!", "content": "I seriously don't get the horrible reviews on this movie! People are constantly hating on Amy and sometimes I feel like they have nothing better to do. I really enjoyed this movie! I thought it had such a good story line and it really spoke to me. I, as with many women, struggle with self esteem and this movie couldn't have shown a better representation of what it's like being on the average or less then average spectrum. It truly was an empowering movie for women and I respect Amy for playing this role. There wasn't a single quiet moment in the theatre tonight. Everyone was laughing!"}
{"rating": "10", "date": ["20 April 2018"], "user_name": "Laura Norman", "user_id": "ur35481307", "title": "BEST THERAPY EVER - HILARIOUS", "content": "Forget the critics, read what real people think. The audience in our theatre was rolling on the floor. My sides hurt when I left the movie. This is a film that real men and women can completely understand. It was absolutely wonderful from start to finish. The crowd was engaged and thoroughly enjoyed the movie. I'll be going back to see it again. Take a friend or meet one when you get there. \"I Feel Pretty\" may not have been a hit with the film critics, but it wasn't written for them. It was made for real people."}
{"rating": "7", "date": ["21 April 2018"], "user_name": "mdlwood", "user_id": "ur38191625", "title": "Go see it! Decide for yourself.", "content": "Listen people. It's not supposed to be an Oscar-worthy, slow, deep, depressing drama. BE SERIOUS. This movie is exactly what it claims to me ... a fun, accurate, timely portrayal of how we treat ourselves and each other! Those side-eyes we all throw and the whispering about each other and \"who does she think she is\" looks ... and the comments we feel entitled to say to each other or about each other. Nailed it. We can do better. I know I can. \nWhat else does it nail? Beauty and confidence come from the inside, how we talk to ourselves does matter, stunningly beautiful people still have feelings and struggles and insecurities, true friends call you out when you're out of line, you don't have to be good at everything, do what you have to do to feel comfortable in your own skin and then ROCK it because you are AMAZING. I laughed. I cried a little. I related and related and related. It's an important, universally-applicable, valuable, timely lesson. Don't listen to the haters about this movie, or anything else really. If you need a pep talk, go see it. If you need to help someone else understand their worth, go see it. If you need a reminder that you're not alone, go see it. If you can only enjoy movies that are Oscar bound, I still think you should see it. I guarantee someone around you needs to hear what it has to say. That's all."}
{"rating": "7", "date": ["21 April 2018"], "user_name": "mdlwood", "user_id": "ur38191625", "title": "Timely, important movie!", "content": "Listen people. It's not supposed to be an Oscar-worthy, slow, deep, depressing drama. BE SERIOUS. This movie is exactly what it claims to me ... a fun, accurate, timely portrayal of how we treat ourselves and each other! Those side-eyes we all throw and the whispering about each other and \"who does she think she is\" looks ... and the comments we feel entitled to say to each other or about each other. Nailed it. We can do better. I know I can. \nWhat else does it nail? Beauty and confidence come from the inside, how we talk to ourselves does matter, stunningly beautiful people still have feelings and struggles and insecurities, true friends call you out when you're out of line, you don't have to be good at everything, do what you have to do to feel comfortable in your own skin and then ROCK it because you are AMAZING. I laughed. I cried a little. I related and related and related. It's an important, universally-applicable, valuable, timely lesson. Don't listen to the haters about this movie, or anything else really. If you need a pep talk, go see it. If you need to help someone else understand their worth, go see it. If you need a reminder that you're not alone, go see it. If you can only enjoy movies that are Oscar bound, I still think you should see it. I guarantee someone around you needs to hear what it has to say. That's all."}
{"rating": "9", "date": ["20 April 2018"], "user_name": "sbeutjer", "user_id": "ur28501013", "title": "Hilarious!!!", "content": "It was a refreshing comedy with great laughs the whole time. She displayed what it feels like to be bigger in this society and what it feels like to lack self confidence. It was a hilarious movie that wasn't just inappropriate raunchy jokes the whole time. She made me laugh and feel so good about myself all at the same time! There was a great message and it was good to see that from a movie straight out of Hollywood. It is a must see!!! Worth the money and worth the time! Glad this movie is out there for people to see and be encouraged and learn to laugh at themselves!!"}
{"rating": "10", "date": ["20 April 2018"], "user_name": "jackxbyrne", "user_id": "ur87561235", "title": "Funny and Enjoyable.", "content": "Just about everyone in a full cinema was laughing. How can that get 2.7 stars!! This is funny and if you are not normally keen on Amy's version of humour (Aussie spelling) it is pretty toned down in this. Please see past the haters comments and see it. If you like the trailer you will love this movie."}
{"rating": null, "date": ["21 April 2018"], "user_name": "mark-azzopardi", "user_id": "ur27589923", "title": "I don't get the hate...", "content": "This is a funny movie! Yes, it's not going to win an any awards, but it certainly deserves more credit than half of these reviews.\nI went to a packed cinema and everyone in there was having a good laugh. There are lots of funny moments tied in with a decent romance and a positive message, albeit a little cheesy. \nDon't pass this up. It's a very enjoyable couple of hours spent."}
{"rating": "6", "date": ["21 April 2018"], "user_name": "eolara19", "user_id": "ur24501545", "title": "Have you ever wished you were pretty?", "content": "Even after seeing such a low rating score, I decided to see this movie because the trailer made me laugh. The jokes could be predictable at times, and perhaps the message that we should seek the beauty on the inside has been heard before, but this story had one more message for the women (and girls) out there who don't feel pretty. \nThe best message in the film was this; when she moved and expressed herself with confidence, people took notice. After hitting her head and believing that some magic made her pretty, Schumer's character predictably began behaving with more confidence and assertiveness. She was still plump, her features didn't change, but the people she came in contact with were impressed, perhaps a little awed, that she appeared to be a woman who was completely comfortable with exactly who she was. THIS is what her new beau, the people in the bar, and the beautiful people at work found attractive in her. A woman who accepted everything about herself, and did not base her self value in what other people thought of her. \nI enjoyed this movie, and it conveys a message more people should see. Accept yourself, with all of your strengths and all of your flaws. Be confident that you are worthwhile, you are enough and that fearlessness in itself, is beautiful."}
{"rating": "1", "date": ["20 April 2018"], "user_name": "djg32514", "user_id": "ur60542591", "title": "Was free and still left early", "content": "Sorry I don't have a lot to write but not much to write about. Very boring story poorly executed starring someone I never heard of. I checked and apparently she is a comedian? Okay. Saw no evidence of comedic talent. Not my kind of movie I guess."}
{"rating": "8", "date": ["21 April 2018"], "user_name": "elizabethartz", "user_id": "ur65444248", "title": "Romantic Comedy", "content": "I liked it! A sweet romantic comedy was\nExactly what I needed!"}
{"rating": "8", "date": ["22 April 2018"], "user_name": "chrismlannan", "user_id": "ur38740429", "title": "Better than I expected", "content": "I thought this movie would be as shallow as the name implies. \nI really liked Amy Schumer in Trainwreck but was disappointed in the one she did with Goldie Hawn. \nThis movie won me over, and I think it is aimed at any woman who has ever felt insecure about her face or weight, or has doubted her worthiness because of her looks. Amy and the writers just get it. I don't think everything she does has to be hilarious the whole time. I love that she made this movie, though I can see that it's not for everyone."}
{"rating": "10", "date": ["20 April 2018"], "user_name": "xsaphyx", "user_id": "ur15019966", "title": "Confused but bad reviews, actually a good movie", "content": "Very confused by all these bad reviews, I think it's a real shame that people just don't like Amy Schumer and feel the need to try and drag her down.\nThis movie had an awesome message. I had a frozen smile on my face this entire movie, when I wasn't overcome with laughter. This movie was well written and perfectly cast. The ending had me emotional and I left the theatre feeling happy. It's not often that a movie makes you feel elated having just watched it. 10/10."}
{"rating": "7", "date": ["22 April 2018"], "user_name": "alexseeley-54692", "user_id": "ur67753512", "title": "Not as bad as you think", "content": "I found myself pretty entertained by this film. Not anything exceptional, but it's a sweet message. There are some funny moments that are found every now and the characters are interesting enough. This isn't anything incredible, but coming from Amy Schumer, I'm leaving the theater happy."}
{"rating": "8", "date": ["21 April 2018"], "user_name": "kirishmiry", "user_id": "ur7268531", "title": "Fun funny and has an important conclusion", "content": "This movie was pretty great for going out to enjoy the evening and even has a good and impotant conclusion we should all embrace.\nThe punch line timings were terrific and I laughed most of the movie.\nI can't understand the 1 and 2 star reviews, I guess Amy has many haters but it's definitly not a low rated movie. The whole theater applauded at the end which is not common here.\nGiving out the message that we all need to have a bit more confidence is so important nowadays with the constant obbsessions of weight loss and the Instagram fashion which is just making everyone extremly obssesed with looks and body shape. I think it's not only a fun and funny movie but can actually improve some lives (kind of remindes me yes man in the way that it is something to think about also after the movie ends).\nThe way Amy acts shows such a difference when full of confidence to shy and embarrased. I couldn't believe what a difference it can make and it's all within us.\nI recommend to go see I Feel Pretty, I have to admit this is my first review ever."}
{"rating": "10", "date": ["21 April 2018"], "user_name": "olgataratuta-20195", "user_id": "ur87600400", "title": "Don't listen to the haters- this is a piece of movie magic", "content": "Amy Schumer delivers a smart, heart-warming, and absolutely hilarious piece of comedy in her new movie \"I Feel Pretty.\" She is raw and real, and that's what I love about this actress. Her newest movie is probably my favourite of hers as I relate to it so much as a woman- it's so important to love yourself for who you are! I brought my boyfriend to see the film and he loved it and was laughing the whole time as well, so I recommend this movie for everyone.\nDon't listen to the haters. This movie has SMART comedy, which I find cinema is lacking so much. I went on opening night to the cinema and the theatre was PACKED. Everyone was laughing the whole way throughout. The fact that this movie has such a low rating just baffles me, and shows blatant prejudice and sexism towards this smart and successful actress and comedy writer. Please don't listen to the poor reviews.\n10/10"}
{"rating": "8", "date": ["22 April 2018"], "user_name": "momontherandom", "user_id": "ur20693127", "title": "Lots of laughs with a great message!", "content": "I don't know what's with all the hater reviews. Was it a predictable storyline? Yes, but the jokes were funny, the supporting cast was excellent and the overall message was positive. I went to a matinee that was about half full and there were plenty of people laughing- some laughed at Stuff even I didn't. I think some of the best parts were the lame excuses she gave people for blowing them off.\nThe actor who played her boyfriend was very refreshing and his reactions were exactly what one would expect. \nI would put this on par with Trainwreck and say it is nothing like her standup. And I walked out wanting to throw out my spanx and sign up for a bikini contest, lol."}
{"rating": "9", "date": ["22 April 2018"], "user_name": "cahrc", "user_id": "ur5292901", "title": "Great Chick Movie", "content": "If you like blood, gore, zombies, car chases, rolling heads, and men beating up/shooting/slashing/killing other men, this movie is NOT for you (isn't that a nice way of saying, \"this movie is not a man's movie?\"). I would suggest that it's possible a lot of guys will hate this movie, while a large number of women will enjoy it.\nMy daughter and I went to this movie and laughed all through it - as did the audience in the packed theater. The laughter was for a lot of reason - outright outrageousness, to \"I can relate,\" to, \"wow - Shumer is taking more risks (in some ways) in this movie than the others she has done.\" \nOne reviewer said, on a positive note, \"this movie is no more than what it claims to be,\" and I think that's a great observation. The casting was great, and there was a subtlety that was great. There was no pandering, and no self-congratulatory type message at the end. The movie was just a snippet of something that females will relate to. (Please, this is not a bash on men - just as I have yet to find a female who likes the Three Stooges - it simply means that sometimes humor can lean toward one gender or another. So, if you are the man that loved this movie, or the female that binge-watches Larry, Curly and Moe, that's great.)\nI don't rate Zombie movies because, I hate them. I'm writing this review because I watch a lot of comedies, and I thought this comedy hit the mark it was aiming for. Lots of fun!"}
{"rating": "10", "date": ["22 April 2018"], "user_name": "spazman-73853", "user_id": "ur70564121", "title": "A++", "content": "A feel good comedy with a good message. The cast is hilarious and the jokes are not recycled from Schumer's stand up. Pretty fresh, empowering, and nothing political."}
{"rating": "9", "date": ["22 April 2018"], "user_name": "richke22", "user_id": "ur45572621", "title": "Good hearted chick flick", "content": "Fun for a night with the girls for a light hearted comedy"}
{"rating": "10", "date": ["20 April 2018"], "user_name": "aussiematt79", "user_id": "ur51819775", "title": "Great movie, couldn't stop laughing!", "content": "My wife and I went to see this. The whole cinema was laughing throughout this movie. Could have gone back in and watched it again! Its one of those happy feel good movies with yes, a couple of cringe worthy bits! Hahaha. Would highly recommend this movie. :-)"}
{"rating": "10", "date": ["22 April 2018"], "user_name": "jefgain", "user_id": "ur3182490", "title": "A funny feel good comedy", "content": "A funny feel good comedy with lots and lots of great laughs. The comedic genius of Amy is worth the price of admission. And Michelle Williams was hysterical and played brilliantly. It was a feel good, fun lots of laughs movie. I loved it."}
{"rating": "8", "date": ["22 April 2018"], "user_name": "snygris", "user_id": "ur57721942", "title": "It's been awhile", "content": "I really liked this movie.. it been quite awhile since I've seen a hilarious movie filled with relatable humor! Would definitely see it again!"}
{"rating": "10", "date": ["22 April 2018"], "user_name": "mawhinney", "user_id": "ur0798180", "title": "Oh Look, The Trolls Are Out In Full Force", "content": "I knew as soon as I looked at the reviews I would see all of the people dead set on trashing every single thing Amy Schumer does.\nThis movie was cute and funny. It wasn't an Oscar-quality film by any means but it was entertaining.\nI am not a fan of Amy's raunchy for the sake of raunchy schtick which she got used to doing so this film was a pleasant surprise that it was quite tame.\nI'll give it a 10 instead of a 7 to cancel out a troll."}
{"rating": "2", "date": ["21 April 2018"], "user_name": "killoranc-91916", "user_id": "ur74548036", "title": "Stop the pain", "content": "So, a woman is strong, powerful no matter who she is or looks like, but this feminist thinks feeling pretty is looking like something else \nGwenth Paltrow's movie about the same thing was way better and portrayed inner beauty rather than Hollywood's idea of it. \nAmy is NOT a good actress."}
{"rating": "5", "date": ["19 April 2018"], "user_name": "gabi_osullivan", "user_id": "ur29315295", "title": "Not terrible, not amazing", "content": "A movie filled with a list actor cameos and a light hearted chick flick to make women accept their flaws and think more positive about body image. While the movie does send a good message you cant seem to get past amy schumers over the top personality that screams 'im trying too hard'."}
{"rating": "7", "date": ["22 April 2018"], "user_name": "mollyrachar", "user_id": "ur87633443", "title": "Fun movie", "content": "I found this to be a small fun movie. If I was younger, I would see it again. Good message to all women having self esteem issues. Liked the PG-13, because I get tired of swearing and being \"gross\" for laughs in comedies."}
{"rating": "8", "date": ["22 April 2018"], "user_name": "crysmichelle", "user_id": "ur6844477", "title": "Don't trust the reviews", "content": "While I wouldn't normally rate this an 8, the hate this film is receiving is unjustified. It's a decent movie which I would expect to see a 5-7 star rating on. There were moments that I rolled my eyes but there were so many other moments as well. Take a friend and go in with mid level expectations. I had extremely low expectations walking in due to the 2.9 average rating. I was pleasantly surprised."}
{"rating": "10", "date": ["22 April 2018"], "user_name": "sandi-50229", "user_id": "ur87615334", "title": "Laugh out loud, cry and learn!", "content": "This isn't a \"deer hunter\" type of movie! It's a very light, hilariously funny (without the normal Amy Schumer vulgar humour-which was a pleasant surprise) and shows the raw insecure side of us all, as we laugh through situations and feelings we have all been through!\nIf you are looking for a deep movie-this isn't it! But if you want to go home feeling great, have a fantastic belly laugh and feel like you paid to be entertained and were (and maybe feel just a little smarter or prettier than when you walked in) then this is well worth the spend!\nFor a fun comedy with a great overall message, I think this was brilliantly written and I would absolutely recommend it to anyone who loves a great feel good movie!"}
{"rating": "10", "date": ["21 April 2018"], "user_name": "ct2323", "user_id": "ur20146688", "title": "Please Don't Listen to the Haters", "content": "I have never spent time writing an IMDB review but this movie deserves a much higher rating. Not only is the message important and heartfelt for girls, women, and the men in their lives, but it's also freaking hilarious! I'm not a Amy Schumer fangirl by any means but she was extremely easy to like and identify with in this role, and her chemistry with the leading man was completely believable and warm. Michelle Williams was the icing on the cake. \nPlease do yourself a favor and see this movie and then comeback and leave a high rating. More people need it's message today more than ever in this insta-society!"}
{"rating": "8", "date": ["21 April 2018"], "user_name": "lidiagroulx", "user_id": "ur53148905", "title": "Fun and funny", "content": "It's a feel-good, funny movie. Just enjoy it and don't analyze every detail, action, dialogue!"}
{"rating": "10", "date": ["22 April 2018"], "user_name": "rainydayinmay-1", "user_id": "ur10461682", "title": "Delightful, must see for women!", "content": "Take a pretty average romantic comedy and then weave the irrefutable truth that we live in a shallow society and women struggle with comparison, judgement, insecurities and unhealthy perceptions throughout. Throw in the idea of unconditional and faithful friendship and love and the reality that ALL women are beautiful- and you have more than a movie... \nI've read so many of the \"hate\" reviews and the majority of them are either people who haven't seen it or are meanly trolling something with a heart obviously bigger than theirs..."}
{"rating": "6", "date": ["21 April 2018"], "user_name": "rockman182", "user_id": "ur12666537", "title": "I Feel Pretty (2018)", "content": "Really not the biggest fan of Amy Schumer, don't think she's that funny. Trainwreck was okay and Snatched was not very funny at all. I liked the trailer for I Feel Pretty because it seemed like an absurd idea but one that I really wanted to see play it. I get that the film had controversy surrounding the casting and content for the premise of the film but my reviews keep outside controversies separated from the review of the film. The film has a few moments where you laugh but most of the good stuff is already in the trailer.\nThe film is about a very insecure girl named Renee and her struggles with everyday acceptance. One day she hits her head while at a soul cycle gym which changes her outlook on her appearance, despite there being no discernible change. All of a sudden her confidence skyrockets, she gets her dream job, starts hanging with a different social circle, and finds a man. Obviously, this feeling and life that she perceives cannot last forever.\nI think Schumer does a good job in the role. The film works at many stages when its not supposed to because Schumer can sell it. I'd commend Michelle Williams as well as this was a different type of role for her and it actually came off well. As mentioned earlier the laughs are sparse. The best laughs are seen in the trailer. The film srunning length doesn't help as there are passages which feel dull and unnecessary. Like the whole arc with Tom Hopper's character. The film becomes predictable as you know exactly where it goes before it gets there. The end message is a good one but one you saw coming miles away.\nOverall, I think there is so much that could have been done in terms of humor with this film but it was a missed opportunity. You had a really committed Amy Schumer to boot but didn't really deliver in the writing of the script. The film gets pretty mixed on what it wants to say as the journey goes on, which a lot of people won't like. I'm open to seeing Schumer in something better. Interesting idea, mostly failed delivery.\n6/10"}
{"rating": "9", "date": ["21 April 2018"], "user_name": "gabbyucan99", "user_id": "ur45867022", "title": "Typical, funny, comedy that fits Amy Schumer's personality", "content": "Overall, this movie delivers what it going for. Comedy with a good message underneath. I appreciate this movie and the values it shows to girls. Be confident no matter the circumstances!"}
{"rating": "10", "date": ["21 April 2018"], "user_name": "Solbash", "user_id": "ur52968243", "title": "Just hilarious!", "content": "This movie had me laughing from the moment it started to the very end. I thought it was well written & Amy Schumer was incredible. Enjoyed every minute. Please ignore all the naysayers on IMDB.and go see it yourself! Did they \"borrow\" a similar concept used in Shallow Hal? Perhaps. But who cares? The movie was way funnier than Shallow Hal and Amy makes you laugh out loud just by looking at her expressions. Don't miss it!"}
{"rating": "1", "date": ["21 April 2018"], "user_name": "mythbuff", "user_id": "ur32022266", "title": "A seemingly good message with obviously horrible execution", "content": "The message of the movie is simple enough and good enough for anyone who's had poor self esteem. But it's A: the same message they've been told their entire lives (it's what's on the INSIDE that counts!) and B: The entire movie is nothing but jokes about how \"ugly and fat\" Amy Schumer thinks she is.\nI get the point of it. Unattractive girl gets a head injury that causes her to see herself as beautiful and it gives her the confidence she needs to succeed. Okay. Sure. A bit insulting to Schumer, but so is everything she does.\nBut the entire movie is nothing but Schumer telling people she's so hot and sexy and those people looking at her like she's insane. A great message there. \"It doesn't matter if you think you're beautiful. Everyone else will still laugh at you because you're ugly.\" For God's sake, the entire TRAILER for this movie was muffin-top jokes, nude jokes, and Amy Schumer saying \"Look how sexy I am!\" while everyone else looked at her with disgust. And we're supposed to laugh at that?\nHere's a tip for Ms Schumer. You can consider yourself beautiful. That's great. Everyone should do it. But don't make a movie about considering yourself beautiful where all of the jokes are about you being \"ugly\"."}
{"rating": "8", "date": ["22 April 2018"], "user_name": "mpolak-55144", "user_id": "ur87628174", "title": "There's a lot of politics in the low viewer score", "content": "Heads up. I see many people here wondering why so many terrible ratings from reviewers. Many even admit not having watched it or all of it. The reason is that she has been very open about her dislike of trump as president and many of his followers feel the need to attack anyone who is not in with trump. So there's the answer as to many of them. \nAmy, love ya. The only \"flaw\" I see is that I think she's very pretty as is."}
{"rating": "10", "date": ["22 April 2018"], "user_name": "michele_h2011", "user_id": "ur54798498", "title": "So confused at the bad reviews", "content": "I'm really confused at peoples negative reviews? This movie is really funny and the message is actually a really good and needed one. \nI laughed out loud several times in this movie - the comedy was unique and fresh not something you've seen over and over. \nIf you like romantic comedies, you'll really enjoy this movie."}
{"rating": "10", "date": ["21 April 2018"], "user_name": "kziegler100", "user_id": "ur29640319", "title": "Just what I needed!!!", "content": "This movie was just what I needed! Amy was so funny and her transformations were fabulous! Great chemistry between Amy and Rory. He was always there for her."}
{"rating": "10", "date": ["21 April 2018"], "user_name": "apointoflightjs", "user_id": "ur62517703", "title": "EVERY WOMAN SHOULD WATCH IT", "content": "I Feel Pretty is to make us feel good about ourselves despite our shortcomings. Its a nice film which tries to be funny. That's its problem but still a very enjoyable film. Go for it."}
{"rating": "1", "date": ["21 April 2018"], "user_name": "brad-pilley", "user_id": "ur7924888", "title": "Awful", "content": "Awful, awful, awful! There really isn't much more to say. 2 minutes of comedy and 80 minutes of insecurity."}
{"rating": "7", "date": ["22 April 2018"], "user_name": "zweethat", "user_id": "ur37223599", "title": "Totally unfair to bash this film", "content": "Done for sport or spite? I don't know. \nAmy holds your attention for two hours surrounded by characters with depth and substance that matter. This is a worthy effort. Of course she exploits her flaws and foibles, but not without compassion nor at the expense of the beautiful people here character reveres. Mine was before a nearly full lively crowd, animated and smiling as they left entertained - and not in a crude way. They liked it and so did I."}
{"rating": "1", "date": ["20 April 2018"], "user_name": "sclafunk", "user_id": "ur86921512", "title": "Next level of abysmality", "content": "I understand Amy Schumer can't make a bad movie Bc anyone who dislikes it is an evil white man who thinks she's fat. Besides her blatant joke stealing and ties to pedophile politicians, she's just not funny anymore. I love trainwreck, but the one after with Goldie hawn was bad. This though, is even worse. I actually walked out of the theater with 25 mins left for the first time in my life. Even both my girl and boyfriend in my polygamous pansexual open relationship disliked it, and they love chubby humor. Stick to stealing word for word jokes from Dave Attell Amy. Thanks Qweeeeeeeen."}
{"rating": "1", "date": ["21 April 2018"], "user_name": "leebalfour", "user_id": "ur4729299", "title": "REally??", "content": "DO we honestly need a movie like this. Is bad enough we tell people being overweight is ok. Now we attempt to laugh about it trying to portray this message be happy its ok. Why not tell the truth that it's better for your self esteem health and happiness to be healthy. Is fine if you feel pretty but stop lying to the world and your self obviously the alternative being fit and healthy is much better. Can't stomach this poor humour and worse message."}
{"rating": "1", "date": ["21 April 2018"], "user_name": "LuminousIntel", "user_id": "ur22994137", "title": "I Feel Sick", "content": "Horrid. Walked out half way through. Spend your money elsewhere."}
{"rating": "10", "date": ["22 April 2018"], "user_name": "theprincessrose", "user_id": "ur60799692", "title": "Lighthearted fun", "content": "What a great movie, and Amy Schumer was perfect for the role. This movie deserves a much higher rating! A must-see for girl's night out."}
{"rating": "10", "date": ["21 April 2018"], "user_name": "mynameistawny", "user_id": "ur36611568", "title": "This movie was made for me", "content": "I absolutely loved this film. I laughed throughout the whole thing and could totally relate to the protagonist, Renee. As a plus size woman, I could relate to Renee's experience and felt they handled it so well. It had such a positive message and I left feeling awesome. I want to watch it again and again. \nThe chemistry between Ethan and Renee is fantastic. I loved all of the characters. \nThe writers did such a great job of setting up these tropes and then changing things up. It was great! I love me a good romantic comedy and this is definitely one!"}
{"rating": "6", "date": ["22 April 2018"], "user_name": "steve beard", "user_id": "ur2929860", "title": "Comedy With A Message", "content": "I saw \"I Feel Pretty\", starring Amy Schumer-Thank You For Your Service, Snatched; Rory Scovel-The House, Ground Floor_tv; Busy Phillips-The Gift, Dawson's Creek_tv and Michelle Williams-The Greatest Showman, Dawson's creek_tv.\nThis is a comedy with a message. I think they should have stuck with the comedy part more and less on the message part. Amy-whom I really like-plays an insecure modern day woman that has low self esteem. She has an accident and bumps her head, and suddenly, she thinks that she is beautiful and she is just chock full of confidence-she doesn't look any different, she just sees herself differently when she sees her reflection. Rory becomes her new boyfriend, Busy is one of her best friends and Michelle is her boss at a fashion and make-up company. The message seems to be that women worry too much about their looks-outer beauty-and instead, they should concentrate more on their worth as a person. In other words, Amy needs to learn that her outside appearance had no effect on her abilities to perform her job or get a boyfriend, etc. She had it in her all the time. I'm sure they meant this to be a liberating message for women in this climate of the Me Too era but their execution just didn't work for me.\nIt's rated \"PG-13\" for language and sexual content-partial nudity-and has a running time of 1 hour & 50 minutes.\nIt's not one that I would buy on DVD but if you like Amy-I do-it would be alright as a rental."}
{"rating": "10", "date": ["24 April 2018"], "user_name": "alisaweiss", "user_id": "ur79544553", "title": "Come on..it's adorable!", "content": "I loved this film. I can't believe the low ratings. It was funny and relatable. Amy Schumer shines while Michelle Williams is adorable. The reviews are much worse on here than how the film actually is. I was surprised. I laughed and cried. I felt so many emotions watching this. Amy Schumer shows vulnerability which is rare for most comics who turn to acting and I can't wait to see what film she does next."}
{"rating": "1", "date": ["21 April 2018"], "user_name": "Kevin Jessup", "user_id": "ur26874099", "title": "Instant Regret", "content": "I feel sorry for all the hardworking people in this movie (actors, crew, etc) that wasted so much of their lives working with Amy. Everything she touches turns to garbage and this movie was no different. I got to see the movie for free but couldn't make it all the way through (and still felt like I deserved some kid of refund). I joined a few dozen people that walked out half way through. \nSave yourself. Don't watch it."}
{"rating": "5", "date": ["20 April 2018"], "user_name": "jakegsummers", "user_id": "ur79898056", "title": "Jake's Movie Stuff \"I Feel Pretty\" Review", "content": "This film is an intriguing one. The premise is silly, and several plot points are ridiculous. However, there are some laugh out loud moments. Amy Schumer does a good job acting, however, I do not know if this was the best choice of actress for this role. I say this because her character lacks self-esteem for not being \"beautiful\" when she is not an ugly person to begin with. In fact, it is not even clear why she doesn't have confidence in herself in the first place. It is never said if it is a weight issue, personality issue, or any other issue she has that she deems herself as not pretty. The message that this film conveys is being able to see a person's inner beauty and not focusing on their outer appearance only. Additionally we could all be more sensitive about others predicaments. The trailers led people to think this film may be about \"body-shaming\", but it was more about finding confidence from within. The plot has issues due to some weak writing in the script. However, some of the dialogue is witty and fun. The story fits a romantic comedy conventions and is quite formulaic in it's approach to romance. The supporting cast is decent, but 95% of the laughs do come from Schumer's character. Michelle Williams does a fine job in her role. It is not the worst comedy in the world, but it isn't the worst one ever either. Overall, I give this film a 5/10."}
{"rating": "5", "date": ["21 April 2018"], "user_name": "Dave McClain", "user_id": "ur62963353", "title": "a respectable but muted nod to the undervalued", "content": "\"I Feel Pretty\" (PG-13, 1:50) is a comedy (with a good bit of drama and some fantasy mixed in) starring Amy Schumer as an insecure young woman who gets the chance to find out what it's like to live the life of a beautiful woman. The movie is co-written and co-directed by both Abby Kohn and Mark Silverstein.\nSchumer plays Renee Bennett, one of two workers in the online division of a fictional make-up company called Lili LeClaire. She works across from a skeezy co-worker named Mason (Adrian Martinez) in a small office under a Chinese restaurant. She dreams of working in the main office on Park Avenue - and being as beautiful as someone like Mallory (Emily Ratajkowski), another woman in her spin class. But alas, she feels stuck in her dead-end job, in her unremarkable overweight body, with all of her insecurities and practically invisible to everyone but her two best friends, Vivian (Aidy Bryant) and Jane (Busy Philipps).\nThen, one otherwise ordinary day (the night after watching \"Big\" on TV and then literally wishing for beauty as she throws coins in a fountain), as Renee is feeling especially inspired by the exuberant leader of her spin class, she gets a little too excited on her bike, falls off and her hits her head. When she comes to, she looks in the mirror and believes that she has suddenly become supermodel-beautiful. Renee practically explodes with excitement and triumphantly meets her confused friends in a bar, convinced they won't recognize her anymore and works hard to \"convince\" them that it's really her - Renee!!\nConvinced that she's now thin and beautiful, Renee suddenly has a confidence that has significant and immediate effects on her life - personally and professionally. In a dry cleaner's, she meets the kind but shy Ethan (Rory Scovel), who doesn't understand her apparently exaggerated confidence at first but soon starts dating her (which has repercussions for her relationship with Vivian and Jane). Renee also improbably gets a job in the Lily LeClaire headquarters, where her confidence and capabilities come to the attention of the beautiful, but insecure Avery LeClaire (Oscar nominee Michelle Williams), who is running the company for her kind, but demanding grandmother, founder Lily LeClaire (Lauren Hutton). \n\"I Feel Pretty\" is well-intentioned, but wholly predictable and only mildly entertaining. Its strength is its life-affirming, empowering and timely advocacy of self-worth and confidence in (and in spite of) the age of Facebook and Instagram, but it's only marginally effective in delivering that message. Based on the character and plot set-up in the previous paragraphs (assuming that this wouldn't be your first time seeing a movie), you can probably write the rest of the story in your head and be pretty accurate. Much of the supporting cast is bland in their roles (except for Williams who is game, but annoying in hers) and even Schumer's considerable comedic talents only give us an occasional chuckle. This movie is, at best, a respectable but muted nod to the undervalued. \"B-\""}
{"rating": "2", "date": ["21 April 2018"], "user_name": "Andy_Aitken", "user_id": "ur3078146", "title": "Amy Schumer would need more than a head injury.", "content": "Really, how is this woman able to stay \"Hollywood\"? Since her first role she is the Mike Myers after the Love Guru, not considered a celebrity of any kind yet she must be in the the executives as they keep trying to give her vehicles that still continue to flop. Which this movie does worse than Shamu at SeaWorld. \nPlease just take this woman off the theatre screens unless there's a remake of Babe, then she can play Babe, the pig."}
{"rating": "10", "date": ["22 April 2018"], "user_name": "kingbrad-14444", "user_id": "ur81056991", "title": "Reddit red necks win again", "content": "Terrible reviews from hateful idiots. It's not a bad movie. Not a great movie. But just like her Netflix special she is the victim of a mob of idiots who have access to the internet"}
{"rating": "10", "date": ["22 April 2018"], "user_name": "pukatkaki", "user_id": "ur51507347", "title": "Good movie", "content": "If you like a nice comedy, got for it!\nGood movie, good laughs, a little bit too long but it's ok.\nI thought it's very good."}
{"rating": "10", "date": ["22 April 2018"], "user_name": "marie-bailey79", "user_id": "ur22974360", "title": "Ame we love you! Ignore the bad reviews.", "content": "It's pretty well known that the early reviews on IMDB are movie people. Go ahead and keep thinking that great movies are about women having sex with monsters (hint hint academy awards). \nThe women were laughing and crying from laughing so hard in the theatre I was in. My 2 best friends had the same experience in the theater they watched this in in another state. \nIs it academy award worthy? no. It is a funny silly movie that keeps regular people entertained. Also Amy Schumer hits a nerve with real women. \nGreat funny movie!"}
{"rating": "5", "date": ["21 April 2018"], "user_name": "hannahgrahambell", "user_id": "ur87608150", "title": "With low expectations, an enjoyable movie", "content": "I Feel Pretty leans with full confidence on its star, Amy Schumer, who carries most of the film's comedic and emotional weight. As a comedy, the movie is rarely laugh-out-loud funny, but Schumer's exuberance and talent will have audiences grinning throughout. None of the jokes are too crude or cruel, and the central conflict is never too dark to take the audience out of their pleasantly amused mood. \nIn terms of storytelling, the main lead Renee is the only fully developed character in the movie. Everyone else serves the tropes of the genre satisfactorily, but no one manages to steal the scenes from the star. At times, the beats that have to be hit feel like a drag, especially towards the end of the movie when the humor is sacrificed for message. However, one could hardly expect this movie to completely subvert chick-flick clichés. At most, the expectation should be that a movie like I Feel Pretty uses the formula lightly. With this standard in mind, the movie more or less succeeds.\nThe message of the film, absolutely crucial to its success, in no way breaks new ground. The idea that inner beauty matters more than outer beauty is a hackneyed message, and the way the film addresses the issue is neither nuanced nor spectacular. But just because the moral and the medium used to tell it are simple, doesn't meant that it isn't a worthwhile message that can be entertaining in the hands of a talented comedian. If one goes into I Feel Pretty with tempered expectations, they will most likely have an enjoyable time."}
{"rating": "1", "date": ["20 April 2018"], "user_name": "carrie_poulter", "user_id": "ur48985874", "title": "I had high hopes!", "content": "I had high hopes and was let down! She's just not funny anymore. Or maybe it's the choices she's making because I know she used to be funny! And have clever material!!"}
{"rating": "8", "date": ["23 April 2018"], "user_name": "delaneyolexa", "user_id": "ur87431533", "title": "The ratings confuse me..", "content": "I'm concerned as to why the ratings for this movie are 3.7. Granted, they were at 2.2 on Friday, so they've gone up since, but still. When I watched the movie it wasn't the greatest of all time, but it was a good movie with a powerful message that needed to be heard. This was the most real movie I've seen in a while and it was refreshing. I went in thinking 'I Feel Pretty' was going to be sheer comedy after watching the trailer, because that's how it was advertised. It had some laughable parts, but the sole focus of the film was not on humor, but on self love and the balance of it. What I mean by this is the movie started out with Amy Schumer being this timid, insecure woman who was afraid to live large. After she hit her head she thought she was someone else and started acting like it. At first it was a good thing, because her confidence was way up. But as this facade went on she began to get more conceited than confident. When she figured out she was the same woman the whole time she realized that it doesn't matter what you look like. You can do whatever you want if you set your mind to it and have some confidence. She figured out the balance of loving yourself. The beginning of the movie was at rock bottom of her self love, the middle was when she was at an unforeseen pinnacle of narcissism, and at the end she was content and confident with herself. I thought this movie carried a lot of weight and should be seen by every single woman in America."}
{"rating": "1", "date": ["22 April 2018"], "user_name": "yoyopa", "user_id": "ur35196867", "title": "Why is Amy Schumer still a thing?", "content": "Out of purely scientific curiosity... who are you people that keep paying to see Amy Schumer movies? I saw this for free and still walked out after 30 mins demanding my money back. Schumer is awfullllllll... at everything...at every moment. Every time she speaks I cringe. I get it... the hollywood Gods want her to be a star but I feel like there's a general consensus among us normies that we don't want to see her do ANYTHING. My hope is that this film plummets in it's second week and we forget about it."}
{"rating": "1", "date": ["21 April 2018"], "user_name": "mathewwestman", "user_id": "ur87375255", "title": "Should have called this one Train Wreck too.", "content": "Amy Schumer is not funny even in the slightest. Wait..... that's not really a spoiler."}
{"rating": "9", "date": ["23 April 2018"], "user_name": "tshand-75-881703", "user_id": "ur54501487", "title": "A very enjoyable, funny movie", "content": "I initially wrote off going to see this movie due to its low rating but when I looked closer given it gets a number of 8+ star ratings I thought it might come down to the viewers preference. I enjoy chick flicks so thought I'd give it a go. I was pleasantly surprised. Definitely my kind of movie with a great message for women of all ages that confidence in who you are is far more important than looks. Highly recommend! My husband enjoyed it too but he likes chick flicks."}
{"rating": "10", "date": ["23 April 2018"], "user_name": "tlsclm", "user_id": "ur69424461", "title": "Funny with a Powerful Message", "content": "Kudos to Amy Schumer for shining the spotlight on a serious issue so many struggle with, delivered with a healthy dose of comedy and charm! This is an OUTSTANDING movie that anyone who's ever battled self-esteem issues MUST see."}
{"rating": "9", "date": ["23 April 2018"], "user_name": "caitlinmmccutcheon", "user_id": "ur41941814", "title": "I loved it", "content": "Comments about Amy not being ugly enough are strange. I think those reviews are missing the point."}
{"rating": "1", "date": ["21 April 2018"], "user_name": "xshanex-54161", "user_id": "ur63278530", "title": "Don't bother.", "content": "Absolute garbage... good luck watching the whole thing. Basically a cinematic eye roll, and the nail in Schumer's already rotting coffin."}
{"rating": null, "date": ["20 April 2018"], "user_name": "rgkarim", "user_id": "ur25226117", "title": "Pretty Life Lesson Wrapped In A Mundane Package", "content": "Comedy takes on many forms and faces, sometimes absurdly clever and other times simplistic slapstick meant to be over the top. It's a genre that offers the most variety, bringing many people into the theaters to make the movie-going experience fun. Given the volume of movies pumped out by the studios though, I find it hard to get stoked for movies that look questionable. So, tonight's review held much mystery as to what was in store. Nevertheless, Robbie K is back in action to share his thoughts as he reviews: \nFilm: I Feel Pretty\nDirectors:\n Abby Kohn, Marc Silverstein\nWriters:\n Abby Kohn, Marc Silverstein\nStars:\n Amy Schumer, Michelle Williams, Emily Ratajkowski \n\nLIKES: \nCute, Not Crude: Schumer's quality is usually how much vulgarity one can cram into a 2-hour film in hopes of bringing nonstop laughs. I Feel Pretty washes that crude nature away, focusing instead on a cuter movie that's more awkward than bluntly grotesque. Such a change was refreshing to see, and for once not too distracting from the story/morals of the film. \nOne component of the Story: I Feel Pretty's story is very basic, but one component in particular stands out and that is the lesson of inner beauty and self-confidence. Like a distorted version of Shallow Hal, the movie is designed to isolate the importance of believing in oneself and how one can succeed if done right. Yet go too far, and one crosses the line to arrogance, becoming the very thing they hated being judged by. These lessons were fun, structured, and in the final scene delivered well with writing that actually had fire, fury, and emotional punch to deliver the teachings they wanted to present. \nEthan: This comedy had me chuckling at times, often due to a well-placed quip, or awkward scenario playing out. Yet the most consistent source of laughs was Rory Scovel as Ethan. The male lead had in both my friend and I's opinions the best delivery of his lines, writing that was the least over the top, and reactions that were appropriate for the mess Schumer's character landed in. Even his nonverbal comedy hit the mark, the simplistic facial expressions enough to emphasize the shock factors this movie brings. In addition, Ethan was a major adorable factor for the relationship, grounding the ridiculousness the relationship held. \nDISLIKES: \nRather Bland: Surprisingly, the lack of crude comedy resulted in the movie feeling rather bland at times, almost like a forced, water downed version of usual style. The slower, lackadaisical parts were hard to keep my eyes open for, making the movie drag at parts that could have been left out. In addition, the lack of gimmicks that she is known to bring were quite absent in this movie, making this movie feel quite off for both my friend and me. So, don't expect to be in stitches the whole time in this film. \nRuined by Trailers: It happened again, despite the few times I saw this trailer, I hadn't expected practically all of the funny parts to be revealed in the movie. I Feel Pretty was sorely ruined by the trailer, leaving little sustenance in the actual movie itself aside from some cute romance, a few chuckle worthy moments, and of course some attractive models. \nOver the Top Comedy: While not cruse, I Feel Pretty still suffers from overusing comedic ploys as the sole means of laughing. The movie lacks much clever comedy, or even a dynamic array of comedy to mix things up, forcing one to sit through mindless banter, half-mumbled complaints, and dare I say boring dialogue for most of the movie. Even her drunk moments lack that bite to shake things up, again resorting to whiney, bouts of crying that did little to make us laugh. \nMessy Story: A strong message brings about a solid foundation to build a story upon, but again the movie got lazy, failing to expand beyond what was shown in the trailer. Character development is practically missing in this movie, lost to the mockery of inner beauty to outer beauty. Ethan may be sweet, but his history is a mystery, with little evolution past the quirky, heart of gold man ready to sweep in and start a relationship with the protagonist. As for the best friends, I can only laugh at the fact they were even introduced, for these women are practically absent during much of the film. And in regards to the impasse of work, even that was rather anticlimactic and weirder than anything else. The summary of this dislike, too many loose ends and lack of comedy to offset these weak story arcs. \n\nThe VERDICT: \nI Feel Pretty held so much potential, but once more the comedy realm has failed to expand upon gimmicks. The film holds an incredible moral lesson, and the final scene drops the hammer to shatter the glass of believing in oneself. That's it though, for the cute nature and the quirky relationship... this game just does nothing to help with the shortcoming of the film. It's bland, with over the top (stale) tactics doing little to correct the rather messy story. Throw in the trailers containing the gold nuggets buried deep in the movie, and you realize there is not much to warrant a trip to theater with this one. It's target audience is a girls' night out for a group looking to relate to a comedy. Otherwise you are just wasting your time. My scores are:\nComedy: 5.0\nMovie Overall: 3.0"}
{"rating": "10", "date": ["22 April 2018"], "user_name": "rdphillips-11866", "user_id": "ur81627519", "title": "Amy Schumer hates Trump so trolls attack her movie", "content": "Alt-Righter hate Amy Schumer so they have bombarded IMDB, Rotten Tomatoes audience score with fake reviews to lower the score. I call them fake reviews because the reviewers have not actually seen the film. We're talking about fat losers that should feel some kinship with Schumer, since fat loser is part of her schtick, but they hate women so much they can't stand her success. Her comedy tours sell out arenas, not just comedy clubs and theatres."}
{"rating": "1", "date": ["21 April 2018"], "user_name": "lisalea-97412", "user_id": "ur82863388", "title": "Oh my Gush! I found this movie 99 Cents, in 2019.", "content": "Gee's this movie wasn't even funny I forgot to laugh. I want to punch air into my popcorn. I bet if she got skinny she wouldn't make anyone laugh. Shallow Hal (2001) is here to save you... Simple crash grab to sell you out."}
{"rating": null, "date": ["21 April 2018"], "user_name": "paulnkrisc", "user_id": "ur64818426", "title": "Droll and unimaginative", "content": "I should have stayed home and mowed my lawn or walked barefoot across broken glass. I just don't understand how people think she is funny."}
{"rating": "9", "date": ["23 April 2018"], "user_name": "tesia-85332", "user_id": "ur71512936", "title": "Light hearted and funny!", "content": "A lot of people may not have enjoyed this movie, especially with their bias towards Amy Schumer, however I very much enjoyed the movie! I think the meaning behind the movie is clear in the trailer, so people being angry about that doesn't make much sense to me. Of course it's going to be obvious, so if you think you know everything, don't go! Going into the theatre, we already know what to expect. Regardless, it's still a funny and light movie that I reccomend to anyone with an open mind and looking for a laugh."}
{"rating": "8", "date": ["23 April 2018"], "user_name": "elessa-40-819253", "user_id": "ur25943096", "title": "Great feel good movie", "content": "All these try hard critics trying to be negative about this movie. Yes it's Amy whom nobody likes (including me) BUT this is a great movie !\nIt's warm funny light hearted and has a really good feel to it. I wasn't going to watch it because of all the negative reviews. I'm so glad I did \nWhat's not to like about a light hearted feel good movie on a lazy Sunday afternoon??\nWatch it! You will be surprised !"}
{"rating": "9", "date": ["23 April 2018"], "user_name": "achchandler", "user_id": "ur78123300", "title": "Not ashamed - loved it!", "content": "Firstly, if you don't like Amy Schumer this isn't the film for you, don't waste your money.\nI'm a huge fan and I laughed (and cringed) my way through. Yes it's been done before but this film isn't attempting to change the world, perhaps just to make you feel a bit better about yourself! It's silly, girl fun, enjoy!"}
{"rating": "8", "date": ["23 April 2018"], "user_name": "bizchique", "user_id": "ur87645664", "title": "Well worth my time and money", "content": "Like others, I don't understand the hate and negativity from other reviews. I imagine the poor reviews are from Daniel Tosh wannabes or a group of hipsters sitting on masters degrees in philosophy. So, if you cannot be categorized into either of the above mentioned, and enjoy Amy Schumer, you'll enjoy this movie."}
{"rating": "3", "date": ["23 April 2018"], "user_name": "jogliore-267-117475", "user_id": "ur30591340", "title": "Good Message Terrible Script", "content": "Good message. Good lead actress but a silly and inane script brings this movie way down. Some scenes were downright stupid. Amy Schumer is charming and her message is valuable but please make a better movie."}
{"rating": "4", "date": ["23 April 2018"], "user_name": "christina_arana", "user_id": "ur83085156", "title": "It could've been a great movie!!!", "content": "When I saw the trailer, I couldn't wait to watch it. I thought \"what a great message that it doesn't matter how you look, it's all about your confidence.\" But I was really underwhelmed. The story is all over the place and every scene seems to linger to long, as is the movie. Their is really no difference between Renee before of after the injury. It would've been better if she dressed frumpier and then sexier with the new confidence and that it would matter how people saw her, because confidence does make a difference in how people perceive you. Any way maybe I was expecting to much. Felt like I wasted 2 hrs of my life."}
{"rating": "9", "date": ["23 April 2018"], "user_name": "sdw61", "user_id": "ur46101495", "title": "Very funny movie with a really good message....", "content": "Honestly, I found this movie to be truly enjoyable and so funny. A friend and I went to see it recently and honestly laughed all the way through the movie. It was truly a feel good movie to us. It has a good message of acceptance. Is it very deep? No, it is not but it does have a very good message of love yourself for who you are and you can be confident without being a super model type.\nIn the way our society has trended over the years to be as \"perfect\" as one can be to be accepted, this movie is a much needed relief in regard to this trend. The push to be model thin and fit, not to mention the need for rhinoplasty, breast implants, cheek implants, facelifts, lip fillers, porcelain veneers, modern hair cuts with the latest color trend, constantly manicured nails, etc. to achieve that perfection, is just TOO much these days for many. It seems to get worse each year instead of better. \nI honestly feel sorry for those who are young and did not grow up in an era where people were much more natural and beauty was not so contrived and pushed by society in such a profound way.I appreciate this movie in helping others to understand through its message that you do not have to be perfect to be valued and accepted.\nI highly recommend this movie."}
{"rating": "1", "date": ["22 April 2018"], "user_name": "cjmamatis", "user_id": "ur66085798", "title": "......", "content": "If I could give this movie a 0/10, I would. Apparently, the Obote sentence is too short of a review to be posted by IMDB, so I'll repeat. If I could give this movie a 0/10, I would."}
{"rating": "9", "date": ["23 April 2018"], "user_name": "Danielle", "user_id": "ur2071359", "title": "This movie is GREAT - for the LADIES!", "content": "DON'T PAY ANY ATTENTION to the many dismissive reviews on this site. If you're a guy between the ages of 16 and 35, this movie is not targeted to you! It's for me, a \"middle aged\" woman. Sorry to break it to you, but some movies are made for us! And if you \"never\" liked Amy Schumer, you probably aren't going to like this movie because, shocker, it has Amy Schumer in it.\nI laughed a lot and so did the other people in the theater with me. And the message is wonderful - that confidence helps you accomplish your goals, so stop listening to that negative voice in your head. A very entertaining film with lots of fun cameos like Lauren Hutton and Naomi Campbell.\nWomen's comedies are held to an impossible standard! And to people who are complaining about the \"politics\" of this film, get outta here. Bridesmaids, the most lauded comedy of the 21st century, had some pretty messed up \"politics\" and that didn't stop people from plunking down their dollars. \nJust grab a sister or a friend and see this movie - you'll be glad you did!"}
{"rating": "2", "date": ["23 April 2018"], "user_name": "hottubz", "user_id": "ur4522911", "title": "$8 and a couple of hours I'll never get back", "content": "A movie only a mother could love. Just how long are we going to be subjected to such drivel? I like silly movies...as long as they are fresh and funny. This is stale and cringe inducing."}
{"rating": "7", "date": ["23 April 2018"], "user_name": "missyjoy25", "user_id": "ur35827757", "title": "Very sweet and anyone who has had body issues (99.99999% of women) can relate", "content": "This was 35% on rotten tomatoes when i bought my 18 dollar ticket so my expectations were fairly low, but love Shumer and liked the premise of the story. I felt the reviews were no way reflective of the quality. \nThis was a very sweet story and extremely relatable for most women. This is definitely not the first movie with a storyline where the main character gets to experience life through a completely different perspective (big, shallow hal, 13 going on 30, Peggy Sue Got Married, freaky Friday, Can't buy me love, the wizard of oz..) but it still is fresh and brings something new to the table. \nShumer is extremely likeable and like Carrie Bradshaw the kind of woman most women would want as a best friend. She's fun, outgoing, hilarious and good natured. \nWill this movie win an academy award? No, but it's still imo very worthwhile and a lot of fun. Some have said that it's absurd that someone who looks like Shumer should feel so insecure. She's pretty and only a teeny bit heaver than the average person, but I think they're missing the point, which is that women are held up to an impossible unachievable standard that only a teeny tiny fraction of the population could ever acheive or maintain and then have massive industries who's entire existence depends on women feeling bad about their looks and therefore needing product to correct this. How someone sees themselves and what they believe about themselves will dramatically influence their life and how others behave towards them."}
{"rating": "1", "date": ["21 April 2018"], "user_name": "da_gillespie", "user_id": "ur71776339", "title": "I Feel Pretty - Review", "content": "Save your money and don't go see this. The movie is a try hard on being funny when really it is just disrespectful to women who don't feel comfortable in their skin. Please. Please don't watch this movie."}
{"rating": "1", "date": ["23 April 2018"], "user_name": "kiomarsnu", "user_id": "ur22798009", "title": "A movie for zombies", "content": "Nothing clever or fresh. If anything it is a remake of a thousand one liners that have lost its humor in the course of time (imagine that one pair of socks or undergarments that you can't bid farewell to yet it's lingering to last bit of life before utterly falling apart) the same people who still laugh at a perpetual fart joke or someone falling down the stairs apparently liked this movie and are posting raving reviews to justify their primitive sense of humor. Don't waste your time..."}
{"rating": "5", "date": ["23 April 2018"], "user_name": "DarkVulcan29", "user_id": "ur4593705", "title": "I liked Amy Schumer in Train Wreck and Snatched, but here not so much.", "content": "Don't get me wrong I Feel Pretty does have some amusing moments, which are delivered by Amy Schumer, but has the movie goes on she just looks for comedy that just isn't there. The problem here is the whole thing is put on Schumer an everybody else in the movie is just nonexistent. \n\nA bump on the head at the gym, makes an insecure woman(Amy Schumer) thinks she has transformed into the beautiful woman ever, while the rest of the world sees her has she always was.\n\nI realize the film is basically trying to be like a reverse Shallow Hal(2001), and the message is the same, but Shallow Hal executed the premise a little better. Amy Schumer does ok what she was giving, but I never felt it went anywhere. And cringing in my seat just waiting for it to end."}
{"rating": "1", "date": ["23 April 2018"], "user_name": "bubblebathgirl", "user_id": "ur18689002", "title": "ABSOLUTELY AWFUL", "content": "Absolutely awful.\nAmy Schumer is simply not funny and her movies have gotten worse and worse. As others have said \"I Feel Pretty\" is a complete wannabe Shallow Hal but without the humor. Schumer needs to just go away. Her stand-up is some of the worst I've ever seen (people actually booed repeatedly) and her mind is as rotten and unattractive as her soul.\nSteer clear."}
{"rating": "1", "date": ["23 April 2018"], "user_name": "jkcart-92698", "user_id": "ur78972104", "title": "Cringeworthy if you actually have a sense of humor.", "content": "I was forced to watch this movie, would never pick it on my own.\nI won't pretend that I didn't go to the theater already disliking Schumer's brand of \"comedy\", but I can defend my opinion.\nSchumer's particular brand of comedy is brain-dead garbage that relies on her calling herself slutty or curtailing to how gross her lady parts are, that is if she's not ripping off someone else's material. No real comedians even take Schumer seriously. You can say that I'm sexist and I kind of am when it comes to my comedy. Though I favor men as the greats I am still a fan of just about any female Saturday Night Live alumn along with Julia Louis-Dreyfus, Chelsea Peretti, and more but then again any female in the category above is significantly more funny.\nAs for \"I feel pretty\", \"Trainwreck\" was significantly more funny and I didn't particularly fancy that movie either though it was watchable. This movie was absurdly cliche and a third rate rip off of Shallow Hal, which wasn't that great itself(The most unwatchable Jack Black performance I've ever seen) but I guess ripping off crappy material is typical of Schumer. After all said and done this is just not a good movie, even my girlfriend who drug me out to watch it didn't like it which is great because there's a better chance she won't repeat her transgressions. 1 star, unwatchable cash grab with no real heart. \nI'd also like to point out that the majority of good ratings on here are clearly generic shills to drive up the rating, there's no real thought or explanation behind them besides \"I don't understand the hate\"."}
{"rating": "4", "date": ["23 April 2018"], "user_name": "subxerogravity", "user_id": "ur59627333", "title": "I felt it was not funny.", "content": "So I heard that there was a little controversy when it came to this film. The only problem that I saw with it is that it's not funny, and of course that's a big problem when you are trying to make people laugh. The message about confidence in your self is not lost on me. I got the message in this movie's bastard cousin, Shallow Hal which starred Jack Black and came out almost two decades ago. Man! I Feel Pretty was desperately clawing its way to a laugh it could not get to. Too bad, caused I loved Trainwreck and Snatched, but I do see a pattern of Schumer's flicks getting weaker and weaker, and she needs to break the habit."}
